#+PROPERTY: header-args:python :session *python* :results value

#+begin_src python :results output
import re
f = open("rosalind_subs.txt", "r")
my_seq = f.read()
hits = re.finditer('(?=(AGAGGCGAG))', my_seq)
indices = [match.span(1)[0] for match in hits]
indices = ' '.join(str(ind+1) for ind in indices)
print(indices)
#+end_src

#+RESULTS:
: 2 9 16 23 109 134 168 279 312 327 346 363 399 423 462 563 587 594 601 612 628 635 663 670 708 738 774 812 827 866
